ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32U5/STM32Cube_FW/STM32U5xx_HAL_Driver/stm32u5xx_hal_xspi.c
        /* Configure the CCR register with all communication parameters */
        MODIFY_REG((*ccr_reg), (XSPI_CCR_IMODE  | XSPI_CCR_IDTR  | XSPI_CCR_ISIZE  |
                                XSPI_CCR_ADMODE | XSPI_CCR_ADDTR | XSPI_CCR_ADSIZE),
                   (pCmd->InstructionMode | pCmd->InstructionDTRMode | pCmd->InstructionWidth |
                    pCmd->AddressMode     | pCmd->AddressDTRMode     | pCmd->AddressWidth));

        /* The DHQC bit is linked with DDTR bit which should be activated */
        if ((hxspi->Init.DelayHoldQuarterCycle == HAL_XSPI_DHQC_ENABLE) &&
            (pCmd->InstructionDTRMode == HAL_XSPI_INSTRUCTION_DTR_ENABLE))
        {
          MODIFY_REG((*ccr_reg), XSPI_CCR_DDTR, HAL_XSPI_DATA_DTR_ENABLE);
        }
      }
      /* Configure the IR register with the instruction value */
      *ir_reg = pCmd->Instruction;

      /* Configure the AR register with the address value */
      hxspi->Instance->AR = pCmd->Address;
    }
    else
    {
      if (pCmd->DataMode != HAL_XSPI_DATA_NONE)
      {
        /* ---- Command with instruction and data ---- */

        /* Configure the CCR register with all communication parameters */
        MODIFY_REG((*ccr_reg), (XSPI_CCR_IMODE | XSPI_CCR_IDTR | XSPI_CCR_ISIZE |
                                XSPI_CCR_DMODE | XSPI_CCR_DDTR),
                   (pCmd->InstructionMode | pCmd->InstructionDTRMode | pCmd->InstructionWidth |
                    pCmd->DataMode        | pCmd->DataDTRMode));
      }
      else
      {
        /* ---- Command with only instruction ---- */

        /* Configure the CCR register with all communication parameters */
        MODIFY_REG((*ccr_reg), (XSPI_CCR_IMODE | XSPI_CCR_IDTR | XSPI_CCR_ISIZE),
                   (pCmd->InstructionMode | pCmd->InstructionDTRMode | pCmd->InstructionWidth));

        /* The DHQC bit is linked with DDTR bit which should be activated */
        if ((hxspi->Init.DelayHoldQuarterCycle == HAL_XSPI_DHQC_ENABLE) &&
            (pCmd->InstructionDTRMode == HAL_XSPI_INSTRUCTION_DTR_ENABLE))
        {
          MODIFY_REG((*ccr_reg), XSPI_CCR_DDTR, HAL_XSPI_DATA_DTR_ENABLE);
        }
      }

      /* Configure the IR register with the instruction value */
      *ir_reg = pCmd->Instruction;

    }
  }
  else
  {
    if (pCmd->AddressMode != HAL_XSPI_ADDRESS_NONE)
    {
      if (pCmd->DataMode != HAL_XSPI_DATA_NONE)
      {
        /* ---- Command with address and data ---- */

        /* Configure the CCR register with all communication parameters */
        MODIFY_REG((*ccr_reg), (XSPI_CCR_ADMODE | XSPI_CCR_ADDTR | XSPI_CCR_ADSIZE |
                                XSPI_CCR_DMODE  | XSPI_CCR_DDTR),
                   (pCmd->AddressMode | pCmd->AddressDTRMode | pCmd->AddressWidth     |
                    pCmd->DataMode    | pCmd->DataDTRMode));
      }
      else
      {
        /* ---- Command with only address ---- */

        /* Configure the CCR register with all communication parameters */
        MODIFY_REG((*ccr_reg), (XSPI_CCR_ADMODE | XSPI_CCR_ADDTR | XSPI_CCR_ADSIZE),
                   (pCmd->AddressMode | pCmd->AddressDTRMode | pCmd->AddressWidth));
      }

      /* Configure the AR register with the instruction value */
      hxspi->Instance->AR = pCmd->Address;
    }
    else
    {
      /* ---- Invalid command configuration (no instruction, no address) ---- */
      status = HAL_ERROR;
      hxspi->ErrorCode = HAL_XSPI_ERROR_INVALID_PARAM;
    }
  }

  return status;
}

#if defined(OCTOSPIM)
/**
  * @brief  Get the current IOM configuration for an XSPI instance.
  * @param  instance_nb : number of the instance
  * @param  pCfg         : configuration of the IO Manager for the instance
  * @retval HAL status
  */
static void XSPIM_GetConfig(uint8_t instance_nb, XSPIM_CfgTypeDef *const pCfg)
{
  uint32_t reg;
  uint32_t value = 0U;
  uint32_t index;

  /* Initialize the structure */
  pCfg->ClkPort    = 0U;
  pCfg->DQSPort    = 0U;
  pCfg->NCSPort    = 0U;
  pCfg->IOLowPort  = 0U;
  pCfg->IOHighPort = 0U;

  if (instance_nb == 2U)
  {
    if ((OCTOSPIM->CR & OCTOSPIM_CR_MUXEN) == 0U)
    {
      value = (OCTOSPIM_PCR_CLKSRC | OCTOSPIM_PCR_DQSSRC | OCTOSPIM_PCR_NCSSRC |
               OCTOSPIM_PCR_IOLSRC_1 | OCTOSPIM_PCR_IOHSRC_1);
    }
    else
    {
      value = OCTOSPIM_PCR_NCSSRC;
    }
  }

  /* Get the information about the instance */
  for (index = 0U; index < OSPI_IOM_NB_PORTS; index ++)
  {
    reg = OCTOSPIM->PCR[index];

    if ((reg & OCTOSPIM_PCR_CLKEN) != 0U)
    {
      /* The clock is enabled on this port */
      if ((reg & OCTOSPIM_PCR_CLKSRC) == (value & OCTOSPIM_PCR_CLKSRC))
      {
        /* The clock correspond to the instance passed as parameter */
        pCfg->ClkPort = index + 1U;
      }
    }

    if ((reg & OCTOSPIM_PCR_DQSEN) != 0U)
    {
      /* The DQS is enabled on this port */
      if ((reg & OCTOSPIM_PCR_DQSSRC) == (value & OCTOSPIM_PCR_DQSSRC))
      {
        /* The DQS correspond to the instance passed as parameter */
        pCfg->DQSPort = index + 1U;
      }
    }

    if ((reg & OCTOSPIM_PCR_NCSEN) != 0U)
    {
      /* The nCS is enabled on this port */
      if ((reg & OCTOSPIM_PCR_NCSSRC) == (value & OCTOSPIM_PCR_NCSSRC))
      {
        /* The nCS correspond to the instance passed as parameter */
        pCfg->NCSPort = index + 1U;
      }
    }

    if ((reg & OCTOSPIM_PCR_IOLEN) != 0U)
    {
      /* The IO Low is enabled on this port */
      if ((reg & OCTOSPIM_PCR_IOLSRC_1) == (value & OCTOSPIM_PCR_IOLSRC_1))
      {
        /* The IO Low correspond to the instance passed as parameter */
        if ((reg & OCTOSPIM_PCR_IOLSRC_0) == 0U)
        {
          pCfg->IOLowPort = (OCTOSPIM_PCR_IOLEN | (index + 1U));
        }
        else
        {
          pCfg->IOLowPort = (OCTOSPIM_PCR_IOHEN | (index + 1U));
        }
      }
    }

    if ((reg & OCTOSPIM_PCR_IOHEN) != 0U)
    {
      /* The IO High is enabled on this port */
      if ((reg & OCTOSPIM_PCR_IOHSRC_1) == (value & OCTOSPIM_PCR_IOHSRC_1))
      {
        /* The IO High correspond to the instance passed as parameter */
        if ((reg & OCTOSPIM_PCR_IOHSRC_0) == 0U)
        {
          pCfg->IOHighPort = (OCTOSPIM_PCR_IOLEN | (index + 1U));
        }
        else
        {
          pCfg->IOHighPort = (OCTOSPIM_PCR_IOHEN | (index + 1U));
        }
      }
    }
  }
}
#endif /* OCTOSPIM */
/**
  @endcond
  */

/**
  * @}
  */

#endif /* HAL_XSPI_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

#endif /* HSPI || HSPI1 || HSPI2 || OCTOSPI || OCTOSPI1 || OCTOSPI2 */
